app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["title", "uhul!"], ["text", "agora foi. :)"], ["updated_at", Tue, 07 Jan 2014 14:02:00 UTC +00:00]]
---
    def update
        @post = Post.find(params[:id])

        if @post.update(params[:post].permit(:title, :text))